Repository: ravend3v/otp2-tasks
Catalog: inClass1/shopping-cart/src/Localization/Resources.*.resx
Languages: fi_fi, ja_jp, sv_se

# LanguageHeader
source: Choose a language / Valitse kieli / Välj språk / 言語を選択
fi_fi: Valitse kieli / Choose a language / Välj språk / 言語を選択
ja_jp: 言語を選択 / Choose a language / Valitse kieli / Välj språk
sv_se: Välj språk / Choose a language / Valitse kieli / 言語を選択

# LanguageOptions
source: 1) English 2) Finnish 3) Swedish 4) Japanese
fi_fi: 1) English 2) Suomi 3) Svenska 4) 日本語
ja_jp: 1) English 2) フィンランド語 3) スウェーデン語 4) 日本語
sv_se: 1) English 2) Finska 3) Svenska 4) 日本語

# ChooseLanguage
source: Select language (1-4):
fi_fi: Valitse kieli (1-4):
ja_jp: 言語を選択してください（1-4）:
sv_se: Välj språk (1-4):

# EnterItemCount
source: Enter the number of items to purchase:
fi_fi: Syötä ostettavien tuotteiden määrä:
ja_jp: 購入する商品の数を入力してください:
sv_se: Ange antalet varor att köpa:

# EnterPrice
source: Enter price for item {0}:
fi_fi: Syötä tuotteen {0} hinta:
ja_jp: 商品の価格を入力してください {0}:
sv_se: Ange priset för vara {0}:

# EnterQuantity
source: Enter quantity for item {0}:
fi_fi: Syötä tuotteen {0} määrä:
ja_jp: 商品の数量を入力してください {0}:
sv_se: Ange mängden för vara {0}:

# ItemTotal
source: Item {0} total: {1}
fi_fi: Tuote {0} yhteensä: {1}
ja_jp: 商品 {0} の合計: {1}
sv_se: Artikel {0} totalt: {1}

# InvalidNumber
source: Invalid number, try again.
fi_fi: Virheellinen numero, yritä uudelleen.
ja_jp: 無効な数値です。もう一度お試しください。
sv_se: Ogiltigt tal, försök igen.

# Total
source: Total cost: {0}
fi_fi: Kokonaishinta: {0}
ja_jp: 合計金額: {0}
sv_se: Totalkostnad: {0}

# Goodbye
source: Press Enter to exit.
fi_fi: Paina Enter lopettaaksesi.
ja_jp: Enterキーで終了します。
sv_se: Tryck Enter för att avsluta.
